<?php

/**
 * Функція для визначення довжини рядка.
 *
 * Ця функція приймає рядок і повертає його довжину, використовуючи кодування UTF-8,
 * щоб коректно обробляти багатобайтові символи.
 *
 * @param string $text Рядок, довжину якого потрібно визначити.
 * @return int Повертає довжину рядка.
 */

function getStringLength($text) {
    // Замінює символи переходу на новий рядок на порожній рядок.
    $text = str_replace("\r\n", "", $text);
    // Повертає довжину рядка в кодуванні UTF-8.
    return mb_strlen($text, 'UTF-8');
}
